app/Controllers/Laporan.php

SELECT `b`.*, `p`.`nama` as `nama_pelanggan`, `pk`.`nama_paket`
FROM `booking` `b`
JOIN `pelanggan` `p` ON `p`.`id_pelanggan` = `b`.`id_pelanggan`
JOIN `paket` `pk` ON `pk`.`id_paket` = `b`.`id_paket`
WHERE MONTH(b.tanggal_booking) = '12'
AND YEAR(b.tanggal_booking) = '2024'
ORDER BY `b`.`tanggal_booking` DESC
---
    public function booking()
    {
        // Get initial data (current month)
        $builder = $this->db->table('booking b');
        $builder->select('b.*, p.nama as nama_pelanggan, pk.nama_paket');
        $builder->join('pelanggan p', 'p.id_pelanggan = b.id_pelanggan');
        $builder->join('paket pk', 'pk.id_paket = b.id_paket');
        $builder->where('MONTH(b.tanggal_booking)', date('m'));
        $builder->where('YEAR(b.tanggal_booking)', date('Y'));
        $builder->orderBy('b.tanggal_booking', 'DESC');

        $data = [
            'title' => 'Laporan Booking',
            'booking' => $builder->get()->getResultArray()

SELECT `b`.*, `p`.`nama` as `nama_pelanggan`, `pk`.`nama_paket`
FROM `booking` `b`
JOIN `pelanggan` `p` ON `p`.`id_pelanggan` = `b`.`id_pelanggan`
JOIN `paket` `pk` ON `pk`.`id_paket` = `b`.`id_paket`
WHERE DATE(b.tanggal_booking) >= '2024-12-01'
AND DATE(b.tanggal_booking) <= '2024-12-23'
ORDER BY `b`.`tanggal_booking` DESC
---
    public function filterBooking()
    {
        $from_date = $this->request->getPost('from_date');
        $to_date = $this->request->getPost('to_date');
        $status = $this->request->getPost('status');

        $builder = $this->db->table('booking b');
        $builder->select('b.*, p.nama as nama_pelanggan, pk.nama_paket');
        $builder->join('pelanggan p', 'p.id_pelanggan = b.id_pelanggan');
        $builder->join('paket pk', 'pk.id_paket = b.id_paket');
        $builder->where('DATE(b.tanggal_booking) >=', $from_date);
        $builder->where('DATE(b.tanggal_booking) <=', $to_date);

        if ($status !== '') {
            $builder->where('b.status', $status);
        }

        $builder->orderBy('b.tanggal_booking', 'DESC');
        $query = $builder->get();

SELECT `b`.*, `p`.`nama` as `nama_pelanggan`, `pk`.`nama_paket`
FROM `booking` `b`
JOIN `pelanggan` `p` ON `p`.`id_pelanggan` = `b`.`id_pelanggan`
JOIN `paket` `pk` ON `pk`.`id_paket` = `b`.`id_paket`
WHERE DATE(b.tanggal_booking) >= '2024-12-01'
AND DATE(b.tanggal_booking) <= '2024-12-22'
ORDER BY `b`.`tanggal_booking` DESC
---
    public function cetakBooking()
    {
        $from_date = $this->request->getGet('from_date');
        $to_date = $this->request->getGet('to_date');
        $status = $this->request->getGet('status');

        // Get data
        $builder = $this->db->table('booking b');
        $builder->select('b.*, p.nama as nama_pelanggan, pk.nama_paket');
        $builder->join('pelanggan p', 'p.id_pelanggan = b.id_pelanggan');
        $builder->join('paket pk', 'pk.id_paket = b.id_paket');
        $builder->where('DATE(b.tanggal_booking) >=', $from_date);
        $builder->where('DATE(b.tanggal_booking) <=', $to_date);

        if ($status !== '') {
            $builder->where('b.status', $status);
        }

        $builder->orderBy('b.tanggal_booking', 'DESC');
        $booking = $builder->get()->getResultArray();

SELECT `t`.*, `b`.`id_booking`, `p`.`nama` as `nama_pelanggan`, `pk`.`nama_paket`, `pk`.`harga` as `total`
FROM `transaksi` `t`
JOIN `booking` `b` ON `b`.`id_booking` = `t`.`id_booking`
JOIN `pelanggan` `p` ON `p`.`id_pelanggan` = `b`.`id_pelanggan`
JOIN `paket` `pk` ON `pk`.`id_paket` = `b`.`id_paket`
WHERE MONTH(t.tanggal_transaksi) = '12'
AND YEAR(t.tanggal_transaksi) = '2024'
ORDER BY `t`.`tanggal_transaksi` DESC
---
    public function transaksi()
    {
        // Get initial data (current month)
        $builder = $this->db->table('transaksi t');
        $builder->select('t.*, b.id_booking, p.nama as nama_pelanggan, pk.nama_paket, pk.harga as total');
        $builder->join('booking b', 'b.id_booking = t.id_booking');
        $builder->join('pelanggan p', 'p.id_pelanggan = b.id_pelanggan');
        $builder->join('paket pk', 'pk.id_paket = b.id_paket');
        $builder->where('MONTH(t.tanggal_transaksi)', date('m'));
        $builder->where('YEAR(t.tanggal_transaksi)', date('Y'));
        $builder->orderBy('t.tanggal_transaksi', 'DESC');

        $data = [
            'title' => 'Laporan Transaksi',
            'transaksi' => $builder->get()->getResultArray()

SELECT `t`.*, `b`.`id_booking`, `p`.`nama` as `nama_pelanggan`, `pk`.`nama_paket`, `pk`.`harga` as `total`
FROM `transaksi` `t`
JOIN `booking` `b` ON `b`.`id_booking` = `t`.`id_booking`
JOIN `pelanggan` `p` ON `p`.`id_pelanggan` = `b`.`id_pelanggan`
JOIN `paket` `pk` ON `pk`.`id_paket` = `b`.`id_paket`
WHERE DATE(t.tanggal_transaksi) >= '2024-12-01'
AND DATE(t.tanggal_transaksi) <= '2024-12-23'
ORDER BY `t`.`tanggal_transaksi` DESC
---
    public function filterTransaksi()
    {
        $from_date = $this->request->getPost('from_date');
        $to_date = $this->request->getPost('to_date');

        $builder = $this->db->table('transaksi t');
        $builder->select('t.*, b.id_booking, p.nama as nama_pelanggan, pk.nama_paket, pk.harga as total');
        $builder->join('booking b', 'b.id_booking = t.id_booking');
        $builder->join('pelanggan p', 'p.id_pelanggan = b.id_pelanggan');
        $builder->join('paket pk', 'pk.id_paket = b.id_paket');
        $builder->where('DATE(t.tanggal_transaksi) >=', $from_date);
        $builder->where('DATE(t.tanggal_transaksi) <=', $to_date);
        $builder->orderBy('t.tanggal_transaksi', 'DESC');

        $query = $builder->get();

SELECT `t`.*, `b`.`id_booking`, `p`.`nama` as `nama_pelanggan`, `pk`.`nama_paket`, `pk`.`harga` as `total`
FROM `transaksi` `t`
JOIN `booking` `b` ON `b`.`id_booking` = `t`.`id_booking`
JOIN `pelanggan` `p` ON `p`.`id_pelanggan` = `b`.`id_pelanggan`
JOIN `paket` `pk` ON `pk`.`id_paket` = `b`.`id_paket`
WHERE DATE(t.tanggal_transaksi) >= '2024-12-01'
AND DATE(t.tanggal_transaksi) <= '2024-12-23'
ORDER BY `t`.`tanggal_transaksi` DESC
---
    public function cetakTransaksi()
    {
        $from_date = $this->request->getGet('from_date');
        $to_date = $this->request->getGet('to_date');

        // Get data
        $builder = $this->db->table('transaksi t');
        $builder->select('t.*, b.id_booking, p.nama as nama_pelanggan, pk.nama_paket, pk.harga as total');
        $builder->join('booking b', 'b.id_booking = t.id_booking');
        $builder->join('pelanggan p', 'p.id_pelanggan = b.id_pelanggan');
        $builder->join('paket pk', 'pk.id_paket = b.id_paket');
        $builder->where('DATE(t.tanggal_transaksi) >=', $from_date);
        $builder->where('DATE(t.tanggal_transaksi) <=', $to_date);
        $builder->orderBy('t.tanggal_transaksi', 'DESC');

        $transaksi = $builder->get()->getResultArray();