app/Models/ModelBooking.php

    public function getBooking()
    {
        $builder = $this->db->table('booking');

        // Lakukan join dengan tabel tbl_donatur2200008
        $builder->select('booking.*, pelanggan.id_pelanggan, pelanggan.nama, pelanggan.alamat, paket.id_paket, paket.nama_paket, paket.jenis_paket, paket.harga');
        $builder->join('pelanggan', 'booking.bokingidpel = pelanggan.id_pelanggan', 'left');
        $builder->join('paket', 'booking.bokingidpaket = paket.id_paket', 'left');

        // Kembalikan hasil query
        return $builder->get();
---
SELECT `booking`.*, `pelanggan`.`id_pelanggan`, `pelanggan`.`nama`, `pelanggan`.`alamat`, `paket`.`id_paket`, `paket`.`nama_paket`, `paket`.`jenis_paket`, `paket`.`harga`
FROM `booking`
LEFT JOIN `pelanggan` ON `booking`.`bokingidpel` = `pelanggan`.`id_pelanggan`
LEFT JOIN `paket` ON `booking`.`bokingidpaket` = `paket`.`id_paket`

    public function getPel()
    {
        $builder = $this->db->table('pelanggan');
        return $builder->get();
---
SELECT *
FROM `pelanggan`

    public function getPaket()
    {
        $builder = $this->db->table('paket');
        return $builder->get();
---
SELECT *
FROM `paket`