app/Models/ModelPelanggan.php

    public function getPelanggan()
    {
      $builder = $this->db->table('pelanggan');
      return $builder->get();
---
SELECT *
FROM `pelanggan`