app/Models/ModelTransaksi.php

    public function getTransaksiWithDetails()
    {
        return $this->select('transaksi.*, booking.tanggal_booking, booking.jam_booking,
                            pelanggan.nama as nama_pelanggan, paket.nama_paket')
            ->join('booking', 'booking.id_booking = transaksi.id_booking')
            ->join('pelanggan', 'pelanggan.id_pelanggan = booking.id_pelanggan')
            ->join('paket', 'paket.id_paket = booking.id_paket')
            ->findAll();
---
SELECT `transaksi`.*, `booking`.`tanggal_booking`, `booking`.`jam_booking`, `pelanggan`.`nama` as `nama_pelanggan`, `paket`.`nama_paket`
FROM `transaksi`
JOIN `booking` ON `booking`.`id_booking` = `transaksi`.`id_booking`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `booking`.`id_pelanggan`
JOIN `paket` ON `paket`.`id_paket` = `booking`.`id_paket`