app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `nama_user` = 'Dea'
---
    public function cek_login($username){
        return $this->db->table('user')->where(array('nama_user'=>$username))->get()->getRowArray();